[
  {
    "name": "React",
    "description": "Conducted different projects using React as a Frontend technology.",
    "experience": 2
  },
  {
    "name": "ASP.NET Core",
    "description": "Built backend services and APIs using ASP.NET Core in professional projects, designing software architecture and implementing scalable, maintainable web applications.",
    "experience": 3
  },
  {
    "name": "C#",
    "description": "Used C# throughout my professional career for developing applications across multiple technologies, including .NET Framework, ASP.NET Core, WPF, Xamarin, and MAUI.",
    "experience": 7
  },
  {
    "name": "Java",
    "description": "Used for various projects during my bachelor's degree and apprenticeship, including desktop and web applications, leveraging technologies such as Spring Boot and JavaFX.",
    "experience": 3
  },
  {
    "name": "JavaScript",
    "description": "Used for web development projects, working with JavaScript and TypeScript, including frameworks and libraries such as Angular and React.",
    "experience": 3
  },
  {
    "name": "TypeScript",
    "description": "Applied in professional and private web development projects, working with Angular and React to build scalable and maintainable applications.",
    "experience": 3
  },
  {
    "name": "CSS",
    "description": "Applied CSS to numerous projects throughout my career.",
    "experience": 7
  },
  {
    "name": "Apache Kafka",
    "description": "Implemented various integrations in multiple professional projects, leveraging Kafka for real-time data streaming and messaging.",
    "experience": 4
  },
  {
    "name": "WCF",
    "description": "Implemented client-server communication for notifying data updates in a multi-client system, applied in professional and freelance projects.",
    "experience": 5
  },
  {
    "name": "WPF",
    "description": "Developed rich desktop applications and created a reusable library with Windows Presentation Foundation, applied in professional and freelance projects.",
    "experience": 7
  },
  {
    "name": "WinForms",
    "description": "Developed desktop applications using Windows Forms, applied in professional projects to build user interfaces and client-server applications.",
    "experience": 3
  },
  {
    "name": "gRPC",
    "description": "Implemented backend communication in microservice architectures and developed a validation concept to ensure reliable data exchange.",
    "experience": 2
  },
  {
    "name": "MongoDB",
    "description": "Worked with MongoDB in both professional and private projects, designing schemas and integrating the database into various applications.",
    "experience": 3
  },
  {
    "name": "MS SQL Server",
    "description": "Used MS SQL Server as a database in professional and freelance projects, designing databases and integrating them into various applications.",
    "experience": 7
  },
  {
    "name": "Angular",
    "description": "Developed web applications in professional and private projects, building components, services, and integrations.",
    "experience": 3
  },
  {
    "name": "Docker",
    "description": "Containerized applications and services in professional projects, enabling consistent deployments and local development environments.",
    "experience": 4
  },
  {
    "name": ".net Framework",
    "description": "Built desktop and server applications across various professional and freelance projects using .net Framework, including WPF, WinForms, and service backends.",
    "experience": 7
  },
  {
    "name": ".NET 8",
    "description": "Developed modern backend services and APIs in professional projects using .NET 8.",
    "experience": 3
  },
  {
    "name": "Kubernetes",
    "description": "Deployed and managed containerized applications in professional environments, working with clusters and basic operations.",
    "experience": 2
  },
  {
    "name": "Grafana",
    "description": "Set up dashboards and visual monitoring for system and application metrics in professional projects.",
    "experience": 2
  },
  {
    "name": "ArgoCD",
    "description": "Worked with GitOps-based deployment workflows in professional projects to automate application releases.",
    "experience": 2
  },
  {
    "name": "Swagger",
    "description": "Documented and tested REST APIs in multiple professional projects using OpenAPI specifications.",
    "experience": 4
  },
  {
    "name": "Python",
    "description": "Applied during bachelor's studies for higher mathematical computations, data processing, and machine learning tasks.",
    "experience": 1
  },
  {
    "name": "Razor Pages",
    "description": "Developed lightweight web interfaces and server-side logic in professional projects.",
    "experience": 1
  },
  {
    "name": "Prometheus",
    "description": "Integrated service metrics and monitoring for backend systems in professional environments.",
    "experience": 1
  },
  {
    "name": "BitBucket",
    "description": "Used for version control, pull requests, and CI/CD pipelines in professional projects.",
    "experience": 4
  },
  {
    "name": "OPC UA",
    "description": "Implemented industrial communication interfaces using OPC UA in professional projects for machine and device connectivity.",
    "experience": 3
  },
  {
    "name": "Xamarin",
    "description": "Developed cross-platform mobile applications using Xamarin in professional projects.",
    "experience": 3
  },
  {
    "name": "NFC",
    "description": "Implemented NFC interactions and proof-of-concept features using NFC technology in professional projects.",
    "experience": 3
  },
  {
    "name": "Scanner Integration",
    "description": "Integrated barcode and hardware scanners using Scanner Integration technology in professional projects.",
    "experience": 3
  },
  {
    "name": "Scale Integration",
    "description": "Connected and integrated industrial scales using Scale Integration technology into business applications in professional projects.",
    "experience": 3
  },
  {
    "name": "Java Spring Boot",
    "description": "Developed backend services and APIs using Java Spring Boot in bachelor projects.",
    "experience": 2
  },
  {
    "name": "PostgreSQL",
    "description": "Designed and managed relational schemas using PostgreSQL in bachelor projects.",
    "experience": 2
  },
  {
    "name": "Flyway",
    "description": "Handled schema migrations and versioning using Flyway for backend systems in bachelor projects.",
    "experience": 2
  },
  {
    "name": "JWT Token",
    "description": "Implemented authentication and authorization mechanisms using JWT Token in bachelor backend projects.",
    "experience": 2
  },
  {
    "name": "JUnit",
    "description": "Created automated tests for Java applications using JUnit in bachelor projects.",
    "experience": 2
  },
  {
    "name": "HTML",
    "description": "Built and adjusted user interfaces using HTML across various projects.",
    "experience": 2
  },
  {
    "name": "JavaFX",
    "description": "Developed desktop applications using JavaFX during bachelor studies.",
    "experience": 2
  },
  {
    "name": "TCP/IP",
    "description": "Implemented network communication features using TCP/IP in professional and freelance projects.",
    "experience": 2
  },
  {
    "name": "Caliburn.Micro",
    "description": "Developed MVVM-based WPF applications using Caliburn.Micro in professional and freelance projects.",
    "experience": 7
  },
  {
    "name": "Entity Framework",
    "description": "Worked extensively with ORM-based data access using Entity Framework in professional and freelance .NET applications.",
    "experience": 7
  },
  {
    "name": ".NET Framework",
    "description": "Developed desktop and backend applications using .NET Framework across multiple long-term professional and freelance projects.",
    "experience": 7
  },
  {
    "name": "Wear OS",
    "description": "Built smartwatch applications and system integrations using Wear OS as part of the bachelor thesis project.",
    "experience": 1
  },
  {
    "name": "Kotlin",
    "description": "Developed Android and Wear OS applications using Kotlin during the bachelor thesis project.",
    "experience": 1
  },
  {
    "name": "Dagger",
    "description": "Implemented dependency injection using Dagger in Android applications during the bachelor thesis project.",
    "experience": 1
  },
  {
    "name": "Hilt",
    "description": "Applied modern dependency injection patterns using Hilt in Android and Wear OS development during the bachelor thesis project.",
    "experience": 1
  },
  {
    "name": "Room",
    "description": "Integrated local persistent storage using Room into Android and Wear OS applications during the bachelor thesis project.",
    "experience": 1
  },
  {
    "name": "Wearable Data Layer API",
    "description": "Implemented communication and data synchronization using Wearable Data Layer API between Wear OS devices and smartphones for the bachelor thesis project.",
    "experience": 1
  },
  {
    "name": "Entity Framework",
    "description": "Worked extensively with ORM-based data access using Entity Framework in professional and freelance .NET applications, including database design and integration.",
    "experience": 7
  },
  {
    "name": "Caliburn.Micro",
    "description": "Developed MVVM-based WPF applications using Caliburn.Micro in professional and freelance projects, including UI architecture and component design.",
    "experience": 7
  },
  {
    "name": "Node.js",
    "description": "Developed backend services and APIs using Node.js in academic projects, implementing scalable server-side applications.",
    "experience": 2
  },
  {
    "name": "C++",
    "description": "Used C++ for system-level programming and algorithm implementation in academic and small-scale projects.",
    "experience": 1
  },
  {
    "name": "C",
    "description": "Applied C for low-level programming tasks and embedded system projects.",
    "experience": 1
  },
  {
    "name": "SQL",
    "description": "Designed, queried, and optimized relational databases using SQL across professional and freelance projects.",
    "experience": 7
  },
  {
    "name": "Flutter",
    "description": "Developed cross-platform mobile applications using Flutter in personal and experimental projects.",
    "experience": 1
  },
  {
    "name": "React Native",
    "description": "Built cross-platform mobile applications using React Native in academic projects.",
    "experience": 2
  }
]
